As of my testing today, it looks like you have to also explicitly define the `location_capacity` (another optional value) or it again states the resource must be force recreated. I thought this could potentially be a provider version issue, but same happens on v0.66.0 as well as v0.70.0. 

**My new config looks like this and does not cause force recreation**:
```hcl
resource "awscc_gamelift_fleet" "example" {
  name              = "TFExampleFleet"
  build_id          = awscc_gamelift_build.example.id
  compute_type      = "EC2"
  ec2_instance_type = "c5.large"
  fleet_type        = "ON_DEMAND"
  # description = "hi"
  
  runtime_configuration = {
    server_processes = [
      {
        concurrent_executions = 1
        launch_path           = "/local/game/gamelift-test-app"
        parameters            = "port:1936 gameSessionLengthSeconds:20"
      },

    ]
  }
  
  ec2_inbound_permissions = [
    {
      from_port : 8101,
      ip_range : "70.127.195.133/32",
      protocol : "UDP",
      to_port : 8999
    },
    {
      from_port : 22,
      ip_range : "70.127.195.133/32",
      protocol : "TCP",
      to_port : 22
    },
  ]
  
  locations = [{
    location = "us-west-2",
    location_capacity = {
      desired_ec2_instances = 1
      max_size = 1
      min_size = 0
    }
  }]
  
  certificate_configuration = {
    certificate_type = "DISABLED"
  }
}
```
**Which gives the following when running `terraform plan`**:
```hcl
Terraform will perform the following actions:

  # awscc_iam_role.example will be updated in-place
  ~ resource "awscc_iam_role" "example" {
      ~ assume_role_policy_document = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "gamelift.amazonaws.com"
                        }
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        id                          = "gamelift-s3-access"
      + permissions_boundary        = (known after apply)
      + policies                    = (known after apply)
        tags                        = [
            {
                key   = "Modified By"
                value = "AWSCC"
            },
            {
                key   = "Environment"
                value = "Development"
            },
        ]
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

```
I thought that adding the (optional) values `locations` and `certificate_configuration` would be a temporary solution, however when making changes to another optional value such as `description`, `terraform plan` shows that it again must be destroyed and recreated. See the below for the new config/plan

**TF Config (with optional description added)**
```hcl
resource "awscc_gamelift_fleet" "example" {
  name              = "TFExampleFleet"
  build_id          = awscc_gamelift_build.example.id
  compute_type      = "EC2"
  ec2_instance_type = "c5.large"
  fleet_type        = "ON_DEMAND"
  description = "hi"
  
  runtime_configuration = {
    server_processes = [
      {
        concurrent_executions = 1
        launch_path           = "/local/game/gamelift-test-app"
        parameters            = "port:1936 gameSessionLengthSeconds:20"
      },

    ]
  }
  
  ec2_inbound_permissions = [
    {
      from_port : 8101,
      ip_range : "70.127.195.133/32",
      protocol : "UDP",
      to_port : 8999
    },
    {
      from_port : 22,
      ip_range : "70.127.195.133/32",
      protocol : "TCP",
      to_port : 22
    },
  ]
  
  locations = [{
    location = "us-west-2",
    location_capacity = {
      desired_ec2_instances = 1
      max_size = 1
      min_size = 0
    }
  }]
  
  certificate_configuration = {
    certificate_type = "DISABLED"
  }
}
```

**The subsequent `terraform plan` shows the following**:
```hcl
Terraform will perform the following actions:

  # awscc_gamelift_fleet.example must be replaced
-/+ resource "awscc_gamelift_fleet" "example" {
      + anywhere_configuration             = (known after apply)
      + apply_capacity                     = (known after apply) # forces replacement
      + description                        = "hi"
      + desired_ec2_instances              = (known after apply)
      ~ fleet_id                           = "fleet-b5d0550c-6bbc-4dbd-bd84-a84e0b11f22e" -> (known after apply)
      ~ id                                 = "fleet-b5d0550c-6bbc-4dbd-bd84-a84e0b11f22e" -> (known after apply)
      + instance_role_arn                  = (known after apply) # forces replacement
      + instance_role_credentials_provider = (known after apply) # forces replacement
      + log_paths                          = (known after apply) # forces replacement
      + max_size                           = (known after apply)
      ~ metric_groups                      = [
          - "default",
        ] -> (known after apply)
      + min_size                           = (known after apply)
        name                               = "TFExampleFleet"
      ~ new_game_session_protection_policy = "NoProtection" -> (known after apply)
      + peer_vpc_aws_account_id            = (known after apply) # forces replacement
      + peer_vpc_id                        = (known after apply) # forces replacement
      + resource_creation_limit_policy     = (known after apply)
      ~ runtime_configuration              = {
          ~ game_session_activation_timeout_seconds = 30 -> (known after apply)
          ~ max_concurrent_game_session_activations = 2147483647 -> (known after apply)
            # (1 unchanged attribute hidden)
        }
      + scaling_policies                   = (known after apply)
      + script_id                          = (known after apply) # forces replacement
      ~ server_launch_parameters           = "port:1936 gameSessionLengthSeconds:20" -> (known after apply)
      ~ server_launch_path                 = "/local/game/gamelift-test-app" -> (known after apply)
        # (7 unchanged attributes hidden)
    }
```